<?php
return array (
   1 => array(
          'sign'=>'YJ',//拼接特权吗用
          'name'=>'越级码',
          'work'=>'用户绑定后直接晋升为最高级-酷特领袖，享受4折零售价结算。',//等级不变  积分在用户原来基础上+  ！！！
          'description'=>'越级升级特权，直接晋升为最高级-酷特领袖，享受4折零售价结算。', //for app
          'message'=>'您已获得创业者越级升级特权，输入特权码升级，直接享受4折零售价结算福利。', // for user
          'member_lv_id'=>4,  //要升级等级
    ),
   2 => array(
         'sign'=>'CJ',//拼接特权吗用
         'name'=>'初级码',
         'work'=>'用户绑定后跃升至初级创业者，享受6折零售价结算。',//等级不变  积分在用户原来基础上+  ！！！
         'description'=>'普通升级特权，直接晋升为最初级-酷特达人，享受6折零售价结算。', //for app
         'message'=>'您已获得创业者初级升级特权，输入特权码升级，直接享受6折零售价结算福利。。', // for user
         'member_lv_id'=>2,
   ),
   20 => array(
       'sign'=>'C',
       'name'=>'酷特E卡',
       'work'=>'用户激活后，面值金额以酷特币形式体现在酷特币账户，可用于购物结算。',//等级不变  积分在用户原来基础上+  ！！！
       'description'=>'用户激活后，面值金额以酷特币形式体现在酷特币账户，可用于购物结算。', //for app
       'message'=>'您已获得创业者酷特E卡特权，输入酷特E卡，直接享受酷特币福利', // for user
   ),
);

?>