<?php 
/**
 * 定义一个常量对象来存储常量信息
 * @author v5
 *
 */
class Constants {
	
	/*	五大类别：西服 3|西裤 2000|衬衣 3000|马夹 4000|大衣	6000*/
	public static $categoriesParent = array(3,2000,3000,4000,6000);
	
	/*	五大类别：西服 3|西裤 2000|衬衣 3000|马夹 4000|大衣	6000*/
	public static $categoriesNameParent = array(3=>'西服',2000=>'西裤',3000=>'衬衣',4000=>'马夹',6000=>'大衣',5000=>'配件');
	
	/* 深度设计-撞色设计 这些在前端显示 */
	public static $designShowParent = array(299,2158,4076,3185,6277);

	/*	面料父id {西服、衬衫、大衣} */
	public static $fabricsParent = array(8001,8030,8050);
	
	/* 深度设计5大类的顶级id */
	public static $designParent = array(298,2157,4075,3184,6276);
	
	/* 款式父id 用于区分线图 */
	public static $graphParent = array(24,2021,3016,4016,6007);
	
	/* 驳头宽，工艺下不纳入出图规则计算 */
	/**
	 * 4049,4041（马夹：下口袋，胸口袋）
	 * 
	 */
	public static $graphRuleoutParent = array(1119,4049,4041);
	
	/**
	 * 31098:下口袋袋盖宽度
	 *
	 */
	public static $graphRuleoutParentCid = array(31098,82);
	
	/* 纽扣-用于交叉生成定制图 [联动因素] */
	public static $buttonsParent = array(371,2192,3215,6349,4112);
	
	/* 字体 - 用于flash前端 个性签名 */
	public static $fontParent = array(5089,518,2523,4155,3248,6413);
	
	/* 颜色 - 用于flash前端 个性签名*/
	public static $colorParent = array(8082,8056,5088,422,2206,2213,4150,3631,6612,6404);
	
	/* 位置 - 用于flash前端 个性签名*/
	public static $locationParent = array(5130,1226,2999,2507,4550,3281,3287,6625,6976,2505,82812,387,1218,6365,3201);
	
	/* 位置 - 用于flash前端 撞色设计*/
	public static $colorLocationParent = array(2164,4077,3186);
	
	
	/* 里料 - 用于flash前端 个性签名*/
	public static $materialParent = array(313,6291);
	
	/* 工艺 - 用于flash前端 一个基本款 工艺只有一种且不在前端显示*/
	public static $processParent = array(2224,435,4992,6409);
	
	/* 个性签名 - 用于订单解析XML数据传给B端*/
	public static $signatureParent = array(417,2318,3246,4147,5081,6395);

	/* 标准码 尺码 - 用于flash前端提供订单数据尺码 */
	public static $sizelParent = array(
			3=>array('165/92Y','170/96Y','175/100Y','180/104Y','185/108Y','165/96A','170/100A','175/104A','180/108A','185/112A','165/100B','170/104B','175/108B','180/112B','185/116B','165/100C','170/104C','175/108C','180/112C','185/116C','165/88Y','170/92Y','175/96Y','180/100Y','185/104Y','165/92A','170/96A','175/100A','180/104A','185/108A','165/96B','170/100B','175/104B','180/108B','185/112B'),
			2000=>array('170/78A','175/82A','180/86A','185/90A','185/94B','170/84A','175/88A','180/92B','185/96B','185/100C','170/90A','175/94A','180/98A','185/102B(1)','185/106B','170/96A','175/100A','180/104A','185/108A','185/112A','170/80Y','175/84Y','180/88Y','185/92Y','185/96A','170/86Y','175/90Y','180/94A','185/98A','185/102B(2)','170/92Y','175/96A','180/100A','185/104B','185/108B'),
			3000=>array('38/XXS','39/XS','40/S','41/M','42/L','43/XL','44/XXL','45/XXXL','46/XXXXL'),
			4000=>array('165/92Y','170/96Y','175/100Y','180/104Y','185/108Y','165/96A','170/100A','175/104A'),
			6000=>array('160/84','160/88','165/84','165/92','165/96','170/100','170/104','170/84','170/88','170/92','170/96','175/100','175/104','175/108','175/112','175/88','175/92','175/96','180/100','180/104','180/108','180/112','180/116','185/108','185/112','185/116','190/116')
			);
	
	
	
	/* 过滤驳头型 -用于flash前端屏蔽*/
	public static $botouParent = array(1119);
	
	/* 过滤隐藏 -用于flash前端屏蔽*/
	public static $hiddenParent = array(2040,82);
	
	
	
}

?>