<?php
    return array(
        'job' => array(    //职业
            '1' => '销售/客服/市场工作',
            '2' => '公关/媒介/广告业',
            '3' => '财务/HR/行政 ',
            '4' => '财务/审计/税务',
            '5' => '项目/质量/高级管理 ',
            '6' => 'IT/互联网/通信 ',
            '7' => '软件/技术开发/系统集成',
            '8' => '互联网产品/运营管理',
            '9' => '房产/建筑/物业管理 ',
            '10' => '房地产开发/经纪/中介',
            '11' => '金融/证券/银行业保险',
            '12' => '服装/纺织/皮革设计',
            '13' => '影视/媒体/出版/印刷',
            '14' => '艺术/设计',
            '15' => '咨询/法律/教育/翻译 ',
            '16' => '教育/培训',
            '17' => '商超/酒店/娱乐管理/服务',
            '18' => '旅游/度假/出入境服务',
            '19' => '保健/美容/美发/健身',
            '20' => '医院/医疗/护理',
            '21' => '公务员/事业单位/科研机构',
            '22' => '兼职/实习/在校学生',
            '23' => '刚毕业的学生',
            '24' => '其他 ',
        ),
        'fabric' => array(   //着装风格
            '1' => '国产面料',
            '2' => '进口面料',
        ),
        'style' => array(   //着装风格
            '1' => '正装',
            '2' => '休闲',
            '3' => '礼服',
        ),
        'color' => array(   //颜色
            '1' => '条纹',
            '2' => '绒面 ',
            '3' => '方格',
            '4' => '提花 ',
            '5' => '素色',
            '6' => '其他',
        ),
        'xifu_price' => array(  //西服价格
            '1' => '1000以下',
            '2' => '1000～1500元',
            '3' => '11500～2000元',
            '4' => '2000～3000元',
            '5' => '3000元以上  ',
        ),
        'xiku_price' => array(
            '1' => '200元以下 ',
            '2' => '200～300元 ',
            '3' => '2300～400元 ',
            '4' => '400～500元',
            '5' => '500元以上',
        ),
        'chenyi_price' => array(
            '1' => '200元以下 ',
            '2' => '200～300元 ',
            '3' => '300～400元 ',
            '4' => '400～500元',
            '5' => '500元以上 ',
        ),
        'liaoce' => array(
            '1' => '需要(需缴费购买)',
            '2' => '不需要',
        ),
        'peixun' => array(
            '1' => '不需要,已配需过',
            '2' => '需要',
        ),
        'liangti' => array(
            '1' => '是',
            '2' => '否',
        ),
        'paigong' => array(
            '1' => '否',
            '2' => '是',
        ),
        'sex' => array(
            '1' => '男',
            '2' => '女',
        ),
        'customs' => array(
            '1' => '普通顾客',
            '2' => '学生',
            '3' => '上班族',
            '4' => '职场白领',
        )
        
            
    );



